#+TITLE:XenHunt Config (base)
#+AUTHOR: Evgeny Berlizov (XenHunt)
#+DESCRIPTION: XenHunt's config of basic features
#+STARTUP: content
#+PROPERTY: header-args :tangle base.el
** Evil-Args
:PROPERTIES:
:CUSTOM_ID: evil-args
:END:
#+begin_src emacs-lisp
(use-package evil-args
  ;; :hook ((emacs-lisp-mode clojure-ts-mode clojure-mode scheme-mode) #'setup-evil-args-for-lisp)
  ;; :init
  ;; (defun my/evil-args-hook ()
  ;;   (setq-local evil-args-delimiters " "))
  ;; (defun my/setup-evil-args-lisp ()
  ;;   (let ((hooks '('emacs-lisp-mode-hook 'clojure-ts-mode-hook 'clojure-mode-hook 'scheme-mode-hook)))
  ;;     (mapcar (lambda (x)
  ;; 		(unless (member #'my/evil-args-hook x)
  ;; 		  (add-hook #'my/evil-args-hook x))) hooks)))
  :config
  ;; (add-hook 'server-after-make-frame-hook #'my/setup-evil-args-lisp)
  ;; bind evil-args text objects
  (define-key evil-inner-text-objects-map "a" 'evil-inner-arg)
  (define-key evil-outer-text-objects-map "a" 'evil-outer-arg)

  ;; bind evil-forward/backward-args
  (define-key evil-normal-state-map "L" 'evil-forward-arg)
  (define-key evil-normal-state-map "H" 'evil-backward-arg)
  (define-key evil-motion-state-map "L" 'evil-forward-arg)
  (define-key evil-motion-state-map "H" 'evil-backward-arg)

  ;; bind evil-jump-out-args
  (define-key evil-normal-state-map "K" 'evil-jump-out-args)
  )
#+end_src

#+RESULTS:
: [nil 26421 43836 28126 nil elpaca-process-queues nil nil 955000 nil]

** Image-Dired+
:PROPERTIES:
:CUSTOM_ID: image-dired
:END:
#+begin_src emacs-lisp
(use-package image-dired+
  :after dired
  :config
  (setq image-diredx-async-mode 1
        image-diredx-adjust-mode 1)
  )
#+end_src

#+RESULTS:
: [nil 26345 33176 786413 nil elpaca-process-queues nil nil 98000 nil]
** Dired-Open-With
:PROPERTIES:
:CUSTOM_ID: dired-open-with
:END:
#+begin_src emacs-lisp
(use-package dired-open-with
  :after dired
  :config
  (evil-define-key 'normal dired-mode-map
    (kbd "C-<return>") 'dired-open-with)
  )
#+end_src

#+RESULTS:
: [nil 26345 34307 967024 nil elpaca-process-queues nil nil 467000 nil]

* Pass
:PROPERTIES:
:CUSTOM_ID: pass
:END:
#+begin_src emacs-lisp
(use-package password-store
  :custom
  (password-store-password-length 45))
(use-package pass)
;; (use-package password-store-menu
;;   :config (password-store-menu-enable))
;; (general-auto-unbind-keys)
#+end_src

#+RESULTS:
: [nil 26423 21558 891351 nil elpaca-process-queues nil nil 273000 nil]

